doc/microchip-description.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>microchip-description</title>
<!-- 2016-09-08 Qui 17:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Pedro Maione" />
</head>
<body>
<div id="content">
<h1 class="title">microchip-description</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. PIC16F87XA</a>
<ul>
<li><a href="#sec-1-1">1.1. Descrição</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> PIC16F87XA</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Descrição</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Devices Included in this Data Sheet:
<ul class="org-ul">
<li>PIC16F873A
</li>
<li>PIC16F874A
</li>
<li>PIC16F876A
</li>
<li>PIC16F877A
</li>
</ul>
</li>

<li>Analog Features:
<ul class="org-ul">
<li>10-bit, up to 8-channel Analog-to-Digital Converter (A/D)
</li>
<li>Brown-out Reset (BOR)
</li>
<li>Analog Comparator module with:
</li>
<li>Two analog comparators
</li>
<li>Programmable on-chip voltage reference (VREF) module
</li>
<li>Programmable input multiplexing from device inputs and internal voltage reference
</li>
<li>Comparator outputs are externally accessible
</li>
</ul>
</li>

<li>High-Performance RISC CPU:
<ul class="org-ul">
<li>Only 35 single-word instructions to learn
</li>
<li>All single-cycle instructions except for program branches, which are two-cycle
</li>
<li>Operating speed: 
<ul class="org-ul">
<li>DC – 20 MHz clock input
</li>
<li>DC – 200 ns instruction cycle
</li>
</ul>
</li>
<li>Up to 8K x 14 words of Flash Program Memory, Up to 368 x 8 bytes of Data Memory (RAM), Up to 256 x 8 bytes of EEPROM Data Memory
</li>
<li>Pinout compatible to other 28-pin or 40/44-pin PIC16CXXX and PIC16FXXX microcontrollers
</li>
</ul>
</li>

<li>Special Microcontroller Features:
<ul class="org-ul">
<li>100,000 erase/write cycle Enhanced Flash program memory typical
</li>
<li>1,000,000 erase/write cycle Data EEPROM memory typical
</li>
<li>Data EEPROM Retention &gt; 40 years
</li>
<li>Self-reprogrammable under software control
</li>
<li>In-Circuit Serial ProgrammingTM (ICSP) via two pins
</li>
<li>Single-supply 5V In-Circuit Serial Programming
</li>
<li>Watchdog Timer (WDT) with its own on-chip RC oscillator for reliable operation
</li>
<li>Programmable code protection
</li>
<li>Power saving Sleep mode
</li>
<li>Selectable oscillator options
</li>
<li>In-Circuit Debug (ICD) via two pins
</li>
</ul>
</li>

<li>Peripheral Features:
<ul class="org-ul">
<li>Timer0: 8-bit timer/counter with 8-bit prescaler
</li>
<li>Timer1: 16-bit timer/counter with prescaler, can be incremented during Sleep via external crystal/clock
</li>
<li>Timer2: 8-bit timer/counter with 8-bit period register, prescaler and postscaler
</li>
<li>Two Capture, Compare, PWM modules
</li>
<li>Capture is 16-bit, max. resolution is 12.5 ns
</li>
<li>Compare is 16-bit, max. resolution is 200 ns
</li>
<li>PWM max. resolution is 10-bit
</li>
<li>Synchronous Serial Port (SSP) with SPI (Master mode) and I 2 CTM (Master/Slave)
</li>
<li>Universal Synchronous Asynchronous Receiver Transmitter (USART/SCI) with 9-bit address detection
</li>
<li>Parallel Slave Port (PSP) – 8 bits wide with external RD, WR and CS controls (40/44-pin only)
</li>
<li>Brown-out detection circuitry for Brown-out Reset (BOR)
</li>
</ul>
</li>

<li>CMOS Technology:
<ul class="org-ul">
<li>Low-power, high-speed Flash/EEPROM technology
</li>
<li>Fully static design
</li>
<li>Wide operating voltage range (2.0V to 5.5V)
</li>
<li>Commercial and Industrial temperature ranges
</li>
<li>Low-power consumption
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pedro Maione</p>
<p class="date">Created: 2016-09-08 Qui 17:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
